app/Http/Livewire/SearchMedico.php

    public function render()
    {
        $users = $this->getUsers();
        $this->getSpecializationsProperty();
        $medicos = Medico::where(DB::raw('lower(nome)'), 'like', '%'.strtolower($this->search).'%')->paginate(10);
---
select * from "medicos" where LOWER(nome) LIKE '%%'