app/Http/Livewire/SearchPaciente.php

select * from "pacientes" where LOWER(nome) LIKE '%%'
---
    public function render()
    {
        $pacientes = Paciente::where(DB::raw('lower(nome)'), 'like', '%'.strtolower($this->search).'%')->get();