app/Http/Controllers/AdminController.php

    public function index()
    {
        $users = User::all();
        $medicos = Medico::all();
        $pacientes = Paciente::all();
---
select * from "users"
select * from "medicos"
select * from "pacientes"

    public function crudMedico ()
    {
        $medicos = Medico::all();
---
select * from "medicos"

    public function crudPaciente ()
    {
        $pacientes = Paciente::all();
---
select * from "pacientes"