app/Http/Controllers/MedicoController.php

select * from "form_diarios"
---
    public function meusPacientes()
    {
        $user  = $this->getUser();
        $medico = $this->getMedico();
        $pacientes = Paciente::all();
        $formsDiario = ModelFormDiario::all();

select * from "pacientes" where "id" = '2' limit 1
select * from "medicos" where "user_id" = 44 limit 1
---
    public function pacienteProcessosForms($idPac, $idForm)
    {
        $forms = ModelFormDiario::where('paciente_id', $idPac)->get();
        $checklist = checklist::where('paciente_id', $idPac)->get();
        $paciente = Paciente::where('id', $idPac)->first();
        $medico = Medico::where('user_id', auth()->user()->id)->first();