app/Http/Controllers/MedicoController.php

select * from "medicos" where "user_id" = 44 limit 1
select * from "users" where "id" = 44 limit 1
---
    public function areamedico()
    {
        $medico = Medico::where('user_id', auth()->user()->id)->first();
        $row = User::where('id', auth()->user()->id)->first();

select * from "medicos" where "user_id" = 44 limit 1
---
    public function criarForms()
    {
        //Sera deletado e implementado em addForm
        $medico = Medico::where('user_id', auth()->user()->id)->first();

select * from "users" where "id" = 44 limit 1
select * from "medicos" where "user_id" = 44 limit 1
select * from "pacientes"
select * from "paciente_medicos" where "medico_id" = 44
---
    public function meusPacientes()
    {

        $user  = User::where('id', auth()->user()->id)->first();
        $medico = Medico::where('user_id', auth()->user()->id)->first();
        $pacientes = Paciente::all();
        $pacMeds = PacienteMedico::where('medico_id', auth()->user()->id)->get();