app/Http/Controllers/ProfileController.php

select * from "pacientes" where "user_id" = 1 limit 1
---
    public function edit(Request $request): View
    {
        $paciente = Paciente::where('user_id', auth()->user()->id)->first();